---
kind: property
id: P:Autodesk.Revit.DB.CameraInfo.IsPerspective
source: html/37b664d0-d6fe-63b8-97f3-d23f3ec7c237.htm
---
# Autodesk.Revit.DB.CameraInfo.IsPerspective Property

Identifies whether the projection is orthographic or perspective

## Syntax (C#)
```csharp
public bool IsPerspective { get; }
```